export const ERAS = [
  "旧石器時代 (~B.C.1万年)",
  "縄文時代 (B.C.1万年~B.C.4C)",
  "弥生時代 (B.C.4C~A.D.3C後半)",
  "古墳時代 (3C後半~7C末)",
  "飛鳥時代 (592~710年)",
  "奈良時代 (710~794年)",
  "平安時代 (794~1185年)",
  "鎌倉時代 (1185~1333年)",
  "室町時代 (1336~1573年)",
  "安土桃山時代 (1573~1603年)",
  "江戸時代（初期: 1603~1651年）",
  "江戸時代（中期: 1651~1786年）",
  "江戸時代（後期: 1787~1853年）",
  "江戸時代（幕末: 1853~1867年）",
  "明治時代（前期: 1868~1890年）",
  "明治時代（中期: 1890~1905年）",
  "明治時代（後期: 1905~1912年）",
  "大正時代 (1912~1926年)",
  "昭和時代（前期: 1926~1945年）",
  "昭和時代（中期: 1945~1955年）",
  "昭和時代（後期: 1955~1989年）",
  "平成時代（前期: 1989~2001年）",
  "平成時代（中期: 2001~2012年）",
  "平成時代（後期: 2012~2019年）",
];

export const QUIZ_SET_SIZE = 10;
export const MEMORIZATION_TIME_SECONDS = 30; // 30 seconds
// For testing:
// export const MEMORIZATION_TIME_SECONDS = 5; 

export const REQUIRED_CORRECT_ANSWERS = 2;